# FabricationRodsConnectionChangedWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationRodsConnectionChangedWarning Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The structural component that the hanger is attached to has changed to a different element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationRodsConnectionChangedWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationRodsConnectionChangedWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationRodsConnectionChangedWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace